Repository: 1738521383/CrossPlatformDiskTest
Catalog: Saplin.CPDT.UICore/Localization/L11ns.*.resx
Languages: fr, ru

# About1
source: This application uses standard OS's file API (WinAPI on Windows, POSIX on Mac and NDK on Android) to measure the speed of data transfer (in Megabytes per Second) between storage device (HDD, SSD, USB flash drive) and system memory(RAM). API calls are done through .NET Framework/Mono.
fr: Cette application utilise l’interface standard API du système d'exploitation (WinAPI pour Windows, POSIX pour Mac et NDK pour Android) pour mesurer la vitesse de transfert des données (mégaoctets / gigaoctets par seconde) entre le périphérique de stockage (HDD, SSD, clé USB) et la mémoire système (RAM). Les appels aux API sont réalisés via .NET Framework/Mono.
ru: Данное приложение использует стандартный API операционной системы (WinAPI для Windows, POSIX на Mac и NDK на Android) для измерения скорости передачи данных (мегабайты/гигабайты в секунду) между устройством хранения (HDD, SSD, флешка) и системной памятью (ОЗУ). Вызовы к API операционных системы реализованы через .NET Framework/Mono.

# About2
source: Sequential read and sequential write tests transfer large chunks of data (megabytes) between RAM and Storage. These tests are representative of such disk operations as large file copying, video recording/encoding/decoding etc.
fr: Les tests de lecture/écriture séquentielle mesurent la vitesse des opérations, dans lesquelles de gros blocs (mégaoctets) de données sont transmis de manière séquentielle. Ces tests représentent des opérations telles que la copie de fichiers volumineux, le codage/décodage vidéo, etc.
ru: Тесты последовательной записи и чтения измеряют скорость операций, при которых большие блоки (мегабайты) данных передаются последовательно. Данные тесты соответствуют таким операциям, как копирование больших файлов, кодирование/декодирование видео и т.д.

# About3
source: Random tests run for 7 seconds each and do transfers in small chunks (4KB and 32KB) at random positions within the test file. These tests show how file system performance influence applications' load times, copying multiple small files, running database queries etc.
fr: Les tests aléatoires durent plusieurs dizaines de secondes et transmettent de petits blocs de données (4 Ko) dans des positions aléatoires dans un fichier de test. Ces tests montrent comment la performance du système de fichiers influence le temps de chargement des applications et du système d'exploitation, le processus de copie de plusieurs petits fichiers, l'exécution de requêtes de base de données, etc.
ru: Тесты с произвольным доступом выполняются на протяжении нескольких десятков секунд и передают небольшие блоки данных (4КБ) в случайных позициях файла. Данные тесты показывают производительность файловой системы в таких задачах, как время загрузки приложений и ОС, копирование большого количества маленьких файлов, выполнение запросов баз данных и т.п.

# About4
source: In 'Options' section you might find settings which may influence test results:
fr: Dans la section "Options", vous trouverez les paramètres qui peuvent affecter les résultats du test:
ru: В разделе "Опции" вы можете найти следующие параметры, влияющие на результаты тестов:

# About5
source: • Write buffering - influences write test. Write operations use intermediary memory buffer and postpone data commit to latter more convenient time for better performance at a cost of less resilient writes (e.g. power failure and not committing to disk write buffer contents).
fr: ' La mise en mémoire tampon de l'écriture - influence les tests d'écriture. Lors des opérations d'écriture, le système d'exploitation peut utiliser une mémoire tampon intermédiaire et retarder l’écriture réelle data commit à des moments plus opportuns (par exemple, lorsqu’une certaine quantité de données est collectée et qu’une grande partie des données peut être sauvegardée à la fois). Ce mode augmente les performances d'écriture au moyen d'une fiabilité moindre (par exemple, dans le cas de coupure de courant certaines données peuvent être perdues).
ru: ' Буферизация записи - влияет на тесты записи. При записи ОС может использовать промежуточный буфер в памяти и откладывать фактическую запись до поздних более удобных моментов (например когда соберется некоторое количество данных и можно за раз сохранить большую порцию данных). Данный режим увеличивает производительность записи за счет меньшей надежности (например при отключении питания часть данных может быть потеряна).

# About6
source: • In-memory file cache - influences read tests. Any file operation requires from OS either transferring file data to memory or memory data to disk, OS will keep those memory pages in RAM until there's pressure for RAM from other apps. In case OS receives subsequent file read/write requests through API it will simply copy the cached memory pages from previous file operations and not utilize the actual storage device. Turning this option on is essential a test of OS's file caching subsystem and RAM speed, rather than storage device test.
fr: ' Le cache de fichier en mémoire - influence les tests de lecture. Pour toutes les opérations de fichiers, le système d'exploitation transfère les données du disque vers la mémoire (lecture) ou depuis la mémoire vers le disque (écriture). Le système d'exploitation stocke ces données dans la RAM jusqu'à ce que d'autres applications en aient besoin. À la réception de demandes de lecture/d’écriture d'un fichier, le système d'exploitation vérifie si les données ont déjà été lues depuis un fichier et si elles sont déjà en mémoire. S'il y a des données codées dans la mémoire, le système d'exploitation ne s'accédera pas au fichier et copiera de la mémoire (ce qui est beaucoup plus rapide que d'accéder au disque). En fait, l’activation de cette option ne teste pas le périphérique de stockage, mais le mécanisme de mise en cache et la RAM.
ru: ' Файловый кэш в памяти - влияет на тесты чтения. При любых файловых операциях ОС либо переносит данные с диска в память (чтение), либо из памяти на диск (запись). При этом данные будут оставлены в памяти до тех пор, пока она не потребуется другим приложениям. При получении запроса на чтение из файла, ОС проверит, считывались ли данные из файла ранее и содержится ли они уже в памяти. При наличии закодированных данных в памяти ОС не будет обращаться к файлу и сделает копирование из памяти (которое существенно быстрее доступа к диску). Включение данной опции, по сути, тестирует не устройство хранение, а механизм кеширования и ОЗУ.

# About7
source: Operations on computers and smartphones are executed by processor (CPU) against data which is loaded in system memory (RAM). This memory is not permanent and limited in size, that's why theres always a permanent storage (SSD, HDD, SD Card - aka "disk/drive"). In many cases the performance of the system is determined not only by CPU (which are usually in the spotlight of advertising and target of numerous benchmarks) but by the performance of memory, specifically RAM and storage. Official specs (especially with smartphones) give little description of storage characteristics, beyond capacity. This application attempts to give clear performance characteristics of memory by isolating and measuring 3 aspects: the speed of reads (transfers from DRIVE-to-RAM). writes (RAM-to-DRIVE) and system memory (copying data from one area in RAM to another).
fr: Sur les ordinateurs et les smartphones, le processeur central n’effectue des opérations que sur les données chargées dans la RAM. Cette mémoire n’est pas permanente et sa taille est limitée, c’est pourquoi le système dispose toujours d’une mémoire permanente (SSD, disque dur, carte SD - ci-après le "disque"). Dans de nombreux cas, la performance du système est déterminée non seulement par le processeur (qui est souvent au centre d’attention des publicités et des benchmarks), mais aussi par la performance de la mémoire, en particulier de la RAM et du disque. Les spécifications officielles (notamment celles des smartphones) présentent peu d'informations sur les caractéristiques de la mémoire, sauf peut-être celles des volumes. Cette application cherche à définir clairement les performances de la mémoire en mettant en évidence et en évaluant trois aspects: la vitesse de lecture (transfert de données du disque vers la RAM), l’écriture (de la RAM vers le disque) et la vitesse de la RAM (copie de données d’une zone de RAM à une autre).
ru: В компьютерах и смартфонах центральный процессор выполняет операции только над данными, которые загружены в оперативную память (ОЗУ). Данная память не постоянная и ограничена в размере, потому в системе всегда присутствует постоянное хранилище (SSD, жесткий диск, SD карта - для простоты "диск"). Во многих случаях производительность системы определяется не только процессором (который зачастую находится в центре внимания в рекламе и бенчмарках) но и производительностью памяти, в частности ОЗУ и диска. Официальные спецификации (особенно это актуально для смартфонов) дают мало информации о характеристиках памяти, кроме разве что объемов. Данное приложение пытается дать четкие характеристики производительности памяти посредством выделения и оценки трех аспектов: скорости чтения (передача данных с диска в ОЗУ), записи (ОЗУ-диск) и непосредственно скорости ОЗУ (копирование блоков внутри ОЗУ).

# About8
source: The application is open-source, you might want to check project's GitHub at:
fr: Cette application est Open Source, veuillez visiter la page du projet sur Github:
ru: Данное приложение имеет открытый исходный код, заходите на страницу проекта на github:

# AndroidSameAliases
source: same drive, different aliases
fr: le même disque
ru: один и тот же диск

source: Available drives:
fr: Disques disponibles:
ru: Доступные диски:

source: B
ru: Б

source: block
fr: bloc
ru: блок

# bps
source: B/s
ru: Б/с

# BreakTest
source: [Esc, B]reak test
fr: [Esc, R]upture
ru: [Esc, П]рервать

# Close
source: [Esc, C]lose
fr: [Esc] Fermer
ru: [Esc] Закрыть

# CsvOption
source: [E]xport test results to CSV
fr: [E]xporter les résultats au format CSV
ru: [Э]кспортировать результаты в CSV

# FileSizeOption
source: [F]ile size:
fr: [T]aille du fichier:
ru: [Р]азмер файла:

source: GB
ru: ГБ

source: GB free
fr: GB disponibles
ru: ГБ свободно

# gbps
source: GB/s
ru: ГБ/с

# HelpButton
source: [?, H]elp
fr: [?] Aide
ru: [?] Помощь

# HintAndroid
source: To start tap on a drive in the list above
fr: Tapez sur le disque ci-dessus pour lancer un test
ru: Нажмите на диск выше для старта

# HintMisc
source: To start tests click on a drive in the list above or press number key
fr: Pour lancer un test cliquez sur un des disques ou sur la touche avec son numéro
ru: Для начала теста кликните по диску выше или нажмите клавишу с его номером

source: KB
fr: Ko
ru: КБ

# kbps
source: KB/s
fr: Ko/s
ru: КБ/с

source: [L]anguage:
fr: [L]angue:
ru: [Я]зык:

source: Max
ru: Макс

source: MB
ru: МБ

# mbps
source: MB/s
ru: МБ/с

# MemCacheOption
source: In-[m]emory file cache:
fr: [M]émoire cache de fichier:
ru: [Ф]айловый кэш в памяти:

# MemCopyTest
source: Memory copy
fr: Copie de la mémoire
ru: Копирование памяти

# MemCopyTestShort
source: Mem. copy
fr: Copie mémoire
ru: Коп. памяти

source: Min
ru: Мин

source: (Off)
ru: (Выкл)

source: (On)
ru: (Вкл)

# OptionsButton
source: [O]ptions
ru: [О]пции

# PickDrive
source: - pick any drive to run perofrmance test against it
fr: - Sélectionnez l'un des disques ci-dessus pour lancer un test
ru: - выберите диск и списка выше для запуска теста

source: [Q]uit
fr: [Q, Q]itter
ru: [Q, В]ыход

# Quiting
source: Terminating application...
fr: Quitter
ru: Завершение работы

# RandomReadTest
source: Random read
fr: Lecture séquentiel
ru: Произвольное чтение

# RandomReadTestShort
source: Rand. read
fr: Lecture aléat.
ru: Произв. чтение

# RandomWriteTest
source: Random write
fr: Ecriture aléatoire
ru: Произвольная запись

# RandomWriteTestShort
source: Rand. write
fr: Ecriture aléat.
ru: Произв. запись

# RefreshButton
source: [R]efresh
fr: [R]afraichir
ru: Об[н]овить

# SequentialReadTest
source: Sequential read
fr: Lecture séq.
ru: Последоват. чтение

# SequentialReadTestShort
source: Seq. read
fr: Lecture séq.
ru: Посл. чтение

# SequentialWriteTest
source: Sequential write
fr: Ecriture séq.
ru: Последоват. запись

# SequentialWriteTestShort
source: Seq. write
fr: Ecriture séq.
ru: Посл. запись

# StatusBreakingTest
source: BREAKING TEST
fr: RUPTURE DU TEST
ru: ОСТАНОВКА ТЕСТА

# StatusTestCompleted
source: Test has completed execution. Test file deleted
fr: Test terminé. Fichier test supprimé
ru: Тест завершен. Тестовый файл удален

# StatusTestCsvCompleted
source: Test execution completed. Test results exported to CVS file
fr: Test terminé. Résultats exportés au format CSV
ru: Тест завершен. Результаты сохранены в CSV файл

# StatusTestError
source: Test execution interrupted due to error
fr: Exécution du test est interrompue suite à une erreur
ru: Тест прераван из за ошибки

# StatusTestInterrupted
source: Test execution interrupted. Test file deleted
fr: L'exécution du test est interrompue. Le fichier test est supprimé
ru: Тест прерван. Тестовый файл удален

# TestInitMemBuffer
source: Initializing test data in RAM...
fr: Initialisation de données de test dans la RAM
ru: Инициализация тестовых данных в памяти

# TestNotEnoughMemory
source: Not enough memory
fr: Mémoire insuffisante
ru: Недостаточно памяти

# TestPurgingMemCache
source: Purging memory cache...
fr: Vidage de mémoire cache...
ru: Очистка кэша в памяти...

# TestRunning
source: Running test...
fr: Test en cours...
ru: Выполнение замеров...

source: Test started
fr: Test commencé
ru: Тест стартовал

# TestSummaryFormatString
source: File size: {0} GB. Free space: {1:0.0} GB. Write Buffering: {2}. In-memory file cache: {3}
fr: Taille du fichier: {0} GB. Disponible: {1:0.0} GB. Écriture bufferisée: {2}. Mémoire cache de fichier: {3}
ru: Размер файла: {0} Гб. Доступно: {1:0.0} Гб. Буферизация записи: {2}. Файловый кэш в памяти: {3}

# TestWarmigUp
source: Warming up...
fr: Préparation...
ru: Разминка...

# WhiteTheme
source: [W]hite theme (restart required)
fr: Thème [b]lanc (redémarrage demandé)
ru: Белая [т]ема (нужен рестарт)

# WriteBufferingOption
source: Write [b]uffering:
fr: [E]criture bufferisée:
ru: [Б]уферизация записи:

# CClose
source: Close
fr: Fermer
ru: Закрыть

source: [D]atabase
fr: [R]ésultats
ru: [Б]аза

# DbNotAvailable
source: \> Results Database isn't available. Check internet connection
fr: Base de données indisponible. Veuillez vérifier la connexion Internet
ru: База результатов недоступна. Проверьте соединение с интернетом

source: [C]ompare
fr: ⇆ Comparer
ru: ⇆ Сравнить
